src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияНачало</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияКонец</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбонентскоеОбслуживание</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
//++ВКМ(ДОБАВЛЕНИЕ), Самжилин Д.Р., 07.07.2026
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_ДобавитьЭлементыНаФорму();
КонецПроцедуры//--ВКМ(Конец ДОБАВЛЕНИЯ), Самжилин Д.Р., 07.07.2026

&НаСервере
//++ВКМ(ДОБАВЛЕНИЕ), Самжилин Д.Р., 07.07.2026
Процедура ВКМ_ДобавитьЭлементыНаФорму()
	
	ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"));
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.ОтображатьЗаголовок = Ложь;
	ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементПериодНачало = Элементы.Добавить("ВКМ_ПериодДействияНачало", Тип("ПолеФормы"), Элементы.ГруппаПериод);
	ЭлементПериодНачало.ПутьКДанным = "Объект.ВКМ_ПериодДействияНачало";
	ЭлементПериодНачало.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементПериодКонец = Элементы.Добавить("ВКМ_ПериодДействияКонец", Тип("ПолеФормы"), Элементы.ГруппаПериод);
	ЭлементПериодКонец.ПутьКДанным = "Объект.ВКМ_ПериодДействияКонец";
	ЭлементПериодКонец.Вид = ВидПоляФормы.ПолеВвода;
	
	ГруппаПлата = Элементы.Добавить("ГруппаПлата", Тип("ГруппаФормы"));
	ГруппаПлата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПлата.ОтображатьЗаголовок = Ложь;
	ГруппаПлата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементПлата = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), Элементы.ГруппаПлата);
	ЭлементПлата.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ЭлементПлата.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементСтоимостьЧас = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Элементы.ГруппаПлата);
	ЭлементСтоимостьЧас.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ЭлементСтоимостьЧас.Вид = ВидПоляФормы.ПолеВвода;
	
	ВКМ_УстановитьВидимостьЭлементов();
	
КонецПроцедуры//--ВКМ(Конец ДОБАВЛЕНИЯ), Самжилин Д.Р., 07.07.2026

&НаСервере
//++ВКМ(ДОБАВЛЕНИЕ), Самжилин Д.Р., 07.07.2026
Процедура ВКМ_УстановитьВидимостьЭлементов()
	
	ЭтоАбонентскоеОбслуживание = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание;
	
	Элементы.ВКМ_ПериодДействияНачало.Видимость        = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость   = ЭтоАбонентскоеОбслуживание;
	
КонецПроцедуры//--ВКМ(Конец ДОБАВЛЕНИЯ), Самжилин Д.Р., 07.07.2026
